a32116150-ctrl/VIPER-S3/sdkconfig.defaults
# VIPER-S3 sdkconfig defaults
# Target: ESP32-S3 WROOM N16R8

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (8MB OSPI PSRAM on N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
# Use PSRAM for HTTP server task stack — saves ~8KB internal DRAM
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# Use PSRAM for malloc when possible (only force internal for tiny allocs)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# WiFi — enable raw 802.11 frame TX/RX (needed for injection + promiscuous)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1

# Allow WiFi promiscuous mode
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# USB OTG — TinyUSB stack
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_NET_MODE_ECM_RNDIS=y
# CONFIG_TINYUSB_MSC_ENABLED is not set

# Camera
CONFIG_CAMERA_TASK_STACK_SIZE=8192
# Enable PSRAM DMA mode for camera — eliminates the 16KB contiguous internal DRAM allocation
# that causes camera init failure when internal DRAM is fragmented by WiFi/LWIP/BLE
CONFIG_CAMERA_PSRAM_DMA=y

# BLE — Host enabled but controller disabled to free ~30KB internal DRAM for HTTP server.
# nimble_port_init() will fail gracefully (logged warning, continues without BLE).
# Re-enable controller: set CONFIG_BT_CONTROLLER_DISABLED=n and CONFIG_BT_CTRL_BLE_MAX_ACT=3
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_CONTROLLER_DISABLED=y
# CONFIG_BT_CTRL_BLE_MAX_ACT is not set (controller disabled)

# LittleFS
CONFIG_LITTLEFS_MAX_PARTITIONS=1
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog — disable to allow long attack loops
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Stack sizes
CONFIG_MAIN_TASK_STACK_SIZE=8192
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Enable hardware crypto acceleration
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_MPI=y

# BLE Extended Advertising & Periodic Advertising
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_ENABLE_PERIODIC_ADV=y
CONFIG_BT_NIMBLE_PERIODIC_ADV_ENH=y

# HTTP Server WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y


# CPU frequency — max for ESP32-S3
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# LWIP — increase max sockets for HTTP server (12 open + 1 reserve)
CONFIG_LWIP_MAX_SOCKETS=16
# Increase LWIP memory pools for reliable HTTP serving
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_TCP_WND_DEFAULT=32768

